In [30]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt

import pickle
from sklearn.linear_model import LinearRegression

In [11]:
data = pd.read_csv('salary.csv')

In [12]:
data

   index experience  test_score  interview_score  salary
0      0        NaN         8.0                9   50000
1      1        NaN         8.0                6   45000
2      2       five         6.0                7   60000
3      3        two        10.0               10   65000
4      4      seven         9.0                6   70000
5      5      three         7.0               10   62000
6      6        ten         NaN                7   72000
7      7     eleven         7.0                8   80000

In [13]:
data['experience'].fillna(0,inplace = True)
data['test_score'].fillna(data['test_score'].mean(),inplace = True)

In [39]:
x = data.iloc[:,1:4]
x

  experience  test_score  interview_score
0          0    8.000000                9
1          0    8.000000                6
2       five    6.000000                7
3        two   10.000000               10
4      seven    9.000000                6
5      three    7.000000               10
6        ten    7.857143                7
7     eleven    7.000000                8

In [40]:
def convert_to_int(word):
    word_dict = {'one':1,'two':2,'three':3,'four':4,
                 'five':5, 'six':6, 'seven':7,
                 'eight':8, 'nine':9, 'ten':10,
                 'eleven':11, 'tweleve':12,'zero':0,
                 0:0 }
    return word_dict[word]

In [41]:
x['experience'] = x['experience'].apply(lambda x : convert_to_int(x))

In [42]:
y = data.iloc[:, -1]

In [43]:
regressor = LinearRegression()

In [44]:
regressor.fit(x,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [45]:
pickle.dump(regressor, open('model.pkl','wb'))

In [48]:
model = pickle.load(open('model.pkl','rb'))
print(model.predict([[5,6,7]]))

[58231.95591138]